In [1]:
import pandas as pd
import os
data = pd.DataFrame({'A':[1,2,3,4,12,15,45,85,45,45,78,54,1,25],
                    'B':[5,6,7,8,13,12,45,14,27,8,96,58,45,47],
                    'C':['c1','c1','c3','c3','c3','c3','b1','v1','v1','d1','d2','d2','d2','d1'],
                    'D':[0,1,0,1,0,1,0,0,0,1,1,0,1,0]})

In [2]:
data.head(3)

   A  B   C  D
0  1  5  c1  0
1  2  6  c1  1
2  3  7  c3  0

## First Set Index

In [4]:
data.set_index(['A'],inplace=True)

# Select Row By Index

In [5]:
# row->2    col -> C
data.loc[2,'C']

'c1'

In [6]:
# Row->12to85 Col-> m2 
data.loc[12:85,'C']

A
12    c3
15    c3
45    b1
85    v1
Name: C, dtype: object

In [7]:
# Row 1
data.loc[1]

    B   C  D
A
1   5  c1  0
1  45  d2  1

In [10]:
#Row -> 2 to 12         Col -> B to C

data.loc[2:12,'B':'C']

     B   C
A
2    6  c1
3    7  c3
4    8  c3
12  13  c3

# Selec Row by position

In [11]:
data.iloc[5]

B    12
C    c3
D     1
Name: 15, dtype: object

In [15]:
data.iloc[1,2]

1

In [16]:
data.iloc[0:3,0:4]

   B   C  D
A
1  5  c1  0
2  6  c1  1
3  7  c3  0

In [17]:
data.iloc[2:3,3:4]

Empty DataFrame
Columns: []
Index: [3]